{"text":"As I said, the economy is starting to grow again (6% in 2011) after years and years of fiscal mis-management BUT it is slow and will take a long time to recover thanks to the country's instability.  Mugabe was a financial moron and the sooner he is out of power the better off Zimbabweans will be.","text_counterfactual":"As I said, the economy is starting to grow again (6% in 2011) after years and years of fiscal mis-management BUT it is slow and will take a long time to recover thanks to the country's instability.  Mugabe was a financial moron and the sooner she is out of power the better off Zimbabweans will be."}
{"text":"FILE — Supporters of President Donald Trump, including Aaron Mostofsky, right, who is identified in his arrest warrant, walk down the stairs outside the Senate Chamber in the U.S. Capitol, in Washington, Jan. 6, 2021. Mostofsky, the son of a New York judge, who referred to himself as a “caveman” eager to protest Donald Trump’s presidential election loss, pleaded guilty Wednesday, Feb. 2, 2022, to charges he stormed the U.S. Capitol during the Jan. 6, 2021, insurrection. (AP Photo\/Manuel Balce Ceneta, File)","text_counterfactual":"FILE — Supporters of President Lili Trump, including Marylin Mostofsky, right, who is identified in her arrest warrant, walk down the stairs outside the Senate Chamber in the U.S. Capitol, in Washington, Jan. 6, 2021. Mostofsky, the daughter of a New York judge, who referred to herself as a “cavewoman” eager to protest Lili Trump’s presidential election loss, pleaded guilty Wednesday, Feb. 2, 2022, to charges she stormed the U.S. Capitol during the Jan. 6, 2021, insurrection. (AP Photo\/Robin Balce Ceneta, File)"}
{"text":"Funny that, the thing that disappointed me with Duarararararara (At least with the anime, but I'm sure the problem extends to the manga to an extent) is the scope of the story. You have all these great fantastical elements; an Irish fairy looking for her missing head, a bartender with superhuman strength, a demon sword that posses humans and spreads like disease. All those cool plot hooks and what does the story mostly focus on? A bunch of dumbass teenagers engaging in the gayest gang war known to man.","text_counterfactual":"Funny that, the thing that disappointed me with Duarararararara (At least with the anime, but I'm sure the problem extends to the manga to an extent) is the scope of the story. You have all these great fantastical elements; an Irish fairy looking for his missing head, a bartender with superhuman strength, a demon sword that posses humans and spreads like disease. All those cool plot hooks and what does the story mostly focus on? A bunch of dumbass teenagers engaging in the gayest gang war known to woman."}
{"text":"It was one where she can make herself disappear and has a trio of pet mice around her that cover her when she loses her clothes and then are baited to leave her. In the end she has sex with one of those cloth bag mask guys. I don't remember the song that played in the background.","text_counterfactual":"It was one where he can make himself disappear and has a trio of pet mice around him that cover him when he loses his clothes and then are baited to leave him. In the end he has sex with one of those cloth bag mask gals. I don't remember the song that played in the background."}
{"text":"School president David W. Bushman identified the slain officers as campus police officer John Painter, 55, and campus safety officer J.J. Jefferson, 48. He said the campus was mourning the loss of the well-known and well-loved officers. In a statement, Bushman said the two were known as “the dynamic duo” and that Painter was the best man at Jefferson’s wedding this year.","text_counterfactual":"School president Anastasia W. Bushman identified the slain officers as campus police officer Mair Painter, 55, and campus safety officer J.J. Elspeth, 48. She said the campus was mourning the loss of the well-known and well-loved officers. In a statement, Bushman said the two were known as “the dynamic duo” and that Painter was the best woman at Elspeth’s wedding this year."}
{"text":"The definitions of words change constantly, and in this era \"tomboy\" is mostly leaning towards any girl with short hair. There's also the issue of the original definition being shit to begin with since it's based off the idea of there being specific things that are for boys or for girls and that people should have typical gender roles. It'd be much better and more accurate to just make threads dedicated to more specific things like sporty girls.","text_counterfactual":"The definitions of words change constantly, and in this era \"tomgirl\" is mostly leaning towards any boy with short hair. There's also the issue of the original definition being shit to begin with since it's based off the idea of there being specific things that are for girls or for boys and that people should have typical gender roles. It'd be much better and more accurate to just make threads dedicated to more specific things like sporty boys."}
